# 4 Listes et Data frames

## 4.1 Listes

Une liste est très proche d’un vecteur, à la différence près qu’une liste
peut contenir des éléments de types différents. 
<br>
En Python, une liste se crée à l’aide de **crochets**.

In [2]:
malist = [5, "cinq", False]
malist

[5, 'cinq', False]

Pour accéder à un élément d'une liste, on utilise **les crochets**.

In [3]:
print(malist[0])
print(malist[1])
print(malist[2])

5
cinq
False

**Attention :** En Python, la numérotation commence à 0 et non à 1 !

Il est possible de modifier un élément d'une liste à l'aide de la commande **=**.

In [11]:
malist[1] = "six"
malist

[5, 'six', False]

Il est possible d'ajouter un élément à une liste à l'aide de la commande **.append()**.

In [12]:
malist.append("hihi")
malist

[5, 'six', False, 'hihi']

## 4.2 Data frames

En Python, le package principale pour créer et gérer les dataframes est **pandas**.

In [5]:
import pandas as pd

### 4.2.1 Créer un Data frame

Pour créer un dataframe en Python, une des manières les plus simple est d'utiliser **un dictionnaire**.
<br>
**Un dictionnaire** en Python est **une collection de liste de mêmes taille**.

In [6]:
d = {'c1': [1, 2, 3, 4, 5], 'c2': [6, 7, 8, 9, 10], 'c3': [11, 12, 13, 14, 15]}

La commande **DataFrame()** de pandas permet de convertir un dictionnaire en dataframe.

In [7]:
df = pd.DataFrame(d)
df

   c1  c2  c3
0   1   6  11
1   2   7  12
2   3   8  13
3   4   9  14
4   5  10  15

Chanque entrée du dictionnaire correspond à **une colonne** du dataframe.
<br>
Les éléments des listes forment **les lignes** du dataframe.

Les dataframes peuvent contenir des informations de différents types. 
<br>
Il faut juste que chaque liste contienne le même nombre d'éléments.

In [8]:
d = {"nom": ["Louis", "Jeanne", "Marc", "Lucie", "Constance"], "age": [18, 22, 27, 19, 24], "canton": ["vs", "be", "vs", "ti", "vd"]}
df = pd.DataFrame(d)
df

         nom  age canton
0      Louis   18     vs
1     Jeanne   22     be
2       Marc   27     vs
3      Lucie   19     ti
4  Constance   24     vd

### 4.2.2 Manipuler un Data frame

Pour avoir un aperçu d'un dataframe, on peut utiliser la commande **head()**.

In [23]:
df.head()

         nom  age canton
0      Louis   18     vs
1     Jeanne   22     be
2       Marc   27     vs
3      Lucie   19     ti
4  Constance   24     vd

Le nombre de ligne et de colonne d'un dataframe peut être obtenu à l'aide de la commande **shape**.

In [24]:
df.shape

(5, 3)

Pour accéder à **une colonne** en particulier, on écrit le nom de la colonne **entre crochets [ ]**.

In [9]:
df["age"]

0    18
1    22
2    27
3    19
4    24
Name: age, dtype: int64

De manière similaire, on peut utiliser **.nom_de_colonne**.

In [19]:
df.age

0    18
1    22
2    27
3    19
4    24
Name: age, dtype: int64

Pour accéder à **une ligne** en particulier, on utilise la commande **loc[ ]**.

In [10]:
df.loc[1]

nom       Jeanne
age           22
canton        be
Name: 1, dtype: object

La commande **loc[ ]** permet aussi d'avoir certaines ligne d'une certaine colonne.

In [18]:
df.loc[0:3, "nom"]

0     Louis
1    Jeanne
2      Marc
3     Lucie
Name: nom, dtype: object

La commande **iloc[ ]** permet d'obtenir certaines **lignes** et certaines **colonnes** d'un dataframe.

In [11]:
df.iloc[0:3,1:3]

   age canton
0   18     vs
1   22     be
2   27     vs

Pour trier un dataframe selon une certaine colonne, on utilise la commande **sort_values**.

In [12]:
df.sort_values(by=['age'], ascending=True)

         nom  age canton
0      Louis   18     vs
3      Lucie   19     ti
1     Jeanne   22     be
4  Constance   24     vd
2       Marc   27     vs

On peut aussi trier un dataframe à l'aide d'opérateurs logiques.

In [13]:
df[df["age"] > 21]

         nom  age canton
1     Jeanne   22     be
2       Marc   27     vs
4  Constance   24     vd

In [14]:
df[df["canton"] == "vs"]

     nom  age canton
0  Louis   18     vs
2   Marc   27     vs

In [27]:
df[df.canton == "vd"]

         nom  age canton
4  Constance   24     vd

### 4.2.3 Importer un fichier .csv en Data Frame

Pour importer un fichier **.csv** en Python, on utilise la commande **read_csv()** de pandas.

In [15]:
data = pd.read_csv("forestfires.csv", sep=';')
data

,iso,umd_tree_cover_loss__year,umd_tree_cover_loss__ha,umd_tree_cover_loss_from_fires__ha
0,AUS,2001,"218816,3021","154497,154"
1,ESP,2001,"32811,05352","7521,44567"
2,FRA,2001,"34420,96339","1602,153341"
3,SWZ,2001,"6734,853711","44,10780785"
4,USA,2001,"1943080,844","294588,3313"
...,...,...,...,...
100,AUS,2021,"261043,5535","132480,9961"
101,ESP,2021,"85791,95758","16094,52825"
102,FRA,2021,"112886,0348","3507,696494"
103,SWZ,2021,"3160,017833","64,02724195"
104,USA,2021,"2043919,938","845693,9824"

In [16]:
data_FRA = data[data["iso"] == "FRA"]
data_FRA

,iso,umd_tree_cover_loss__year,umd_tree_cover_loss__ha,umd_tree_cover_loss_from_fires__ha
2,FRA,2001,"34420,96339","1602,153341"
7,FRA,2002,"33888,39717","1917,373592"
12,FRA,2003,"26393,33418","3576,5194"
17,FRA,2004,"76134,34456","5940,708768"
22,FRA,2005,"46390,59105","1977,7202"
27,FRA,2006,"55049,47436","1222,918781"
32,FRA,2007,"49246,17317","1193,650199"
37,FRA,2008,"86955,39993","1354,842189"
42,FRA,2009,"67053,59918","1382,878727"
47,FRA,2010,"143265,2096","3041,590746"
52,FRA,2011,"64074,31686","1127,449088"
57,FRA,2012,"67302,61843","2592,017526"
62,FRA,2013,"30351,83693","329,2878852"
67,FRA,2014,"44359,06366","695,6611083"
72,FRA,2015,"37292,53033","436,2480508"
77,FRA,2016,"60768,46951","1980,034439"
82,FRA,2017,"69249,04325","5856,670052"
87,FRA,2018,"69201,43579","2657,349593"
92,FRA,2019,"81304,16864","3297,768365"
97,FRA,2020,"77745,73714","2518,470592"
102,FRA,2021,"112886,0348","3507,696494"